_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Image-Input (InputLayer)     (None, 17, 27, 1)         0         
_________________________________________________________________
Conv1 (Conv2D)               (None, 17, 27, 16)        80        
_________________________________________________________________
Pool1 (MaxPooling2D)         (None, 8, 13, 16)         0         
_________________________________________________________________
Conv2 (Conv2D)               (None, 8, 13, 32)         2080      
_________________________________________________________________
Pool2 (MaxPooling2D)         (None, 4, 6, 32)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 768)               0         
_________________________________________________________________
Dense1 (Dense)               (None, 128)               98432     
_________________________________________________________________
predictions (Dense)          (None, 2)                 258       
=================================================================
Total params: 100,850
Trainable params: 100,850
Non-trainable params: 0
_________________________________________________________________
