_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Image-Input (InputLayer)     (None, 84, 12, 1)         0         
_________________________________________________________________
Conv1 (Conv2D)               (None, 84, 12, 16)        80        
_________________________________________________________________
Pool1 (MaxPooling2D)         (None, 42, 6, 16)         0         
_________________________________________________________________
Conv2 (Conv2D)               (None, 42, 6, 32)         2080      
_________________________________________________________________
Pool2 (MaxPooling2D)         (None, 21, 3, 32)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2016)              0         
_________________________________________________________________
Dense1 (Dense)               (None, 128)               258176    
_________________________________________________________________
predictions (Dense)          (None, 2)                 258       
=================================================================
Total params: 260,594
Trainable params: 260,594
Non-trainable params: 0
_________________________________________________________________
